[
  {
    "name": "Nimbus",
    "description": "A Unity-based mobile game combining tactical puzzle solving and exploration. 10,000+ downloads.",
    "tech": ["Unity", "C#", "AI logic", "Animation"],
    "link": "https://ooink.fun"
  },
  {
    "name": "Lantern Model Rendering",
    "description": "A research project creating detailed 3D lanterns using OpenSCAD, Blender, and Three.js. Published at DAI 2023.",
    "tech": ["Blender", "OpenSCAD", "Three.js"],
    "link": "https://github.com/Dionysos599/CG_Project"
  },
  {
    "name": "Food Express",
    "description": "A scalable online food ordering platform built with Spring Boot and React, deployed with AWS.",
    "tech": ["Spring Boot", "PostgreSQL", "React", "AWS"],
    "link": "https://5qsts38p4t.us-east-2.awsapprunner.com"
  },
  {
    "name": "Customizable and Interactive Music Box",
    "description": "This project presents a fully customizable and modular music box system that transforms MIDI files into parametric 3D-printable spinner models. Built using OpenSCAD, the system automatically generates structural components based on musical input, enabling users to 3D print unique music box tops that can be mounted directly onto a reusable base. This automation allows users to create musically-driven, mechanically accurate physical objects with minimal manual design. The model is fully parameterized, supporting customization in music length, spinner size, note density, and rhythm mapping. The modular architecture enables fast adaptation across different songs and performance scenarios. The project also incorporates a novel contactless actuation mechanism to strike keys without physical wear, improving long-term sound quality and mechanical durability. Materials are selected based on function—biodegradable PLA for light, non-load-bearing modules and ABS for core structural parts—balancing sustainability and robustness. Designed and developed in collaboration with mechanical engineering students from Stanford and supported by the UW CRAFT² initiative, this music box bridges creative coding, digital fabrication, and tangible interaction. It serves as both an engineering artifact and a tool for creative exploration in educational settings.",
    "tech": ["OpenSCAD", "MIDI Parsing", "3D Printing", "Mechanical Design", "Parametric Modeling", "Modular Systems"]
  }
] 